app/controllers/tweets_controller.rb

INSERT INTO `tweets` (`body`, `author_id`, `parent_id`, `created_at`) VALUES('I just delivered a pepperoni pizza!', 1, NULL, '2009-10-28 23:39:03')
---
  def create
    @tweet = Tweet.new(params[:tweet])
    @tweet.author = @current_user

    respond_to do |format|
      if @tweet.save