app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT * FROM `users` LIMIT 1

  def show
    @user = User.find(params[:id])
---
SELECT * FROM `users` WHERE (`users`.`id` = 1)

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO `users` (`name`, `created_at`, `updated_at`, `username`, `bio`) VALUES('Aaron Soules', '2009-10-28 22:16:31', '2009-10-28 22:16:31', 'asoules', 'some guy')